Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetProjectBasePoint Method
 Gets the project base point, if any set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BasePoint GetProjectBasePoint()
Public Shared Function GetProjectBasePoint As BasePoint
Return Value
Type: BasePoint
The project base point, if set. Otherwise null.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace